hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F4A2.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DAC1">
            <name>DAC2</name>
            <description>desc DAC</description>
            <baseAddress>0x40041400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1E</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>DBGC</name>
            <description>desc DBGC</description>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MCUDBGCSTAT</name>
                    <description>desc MCUDBGCSTAT</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CDBGPWRUPREQ</name>
                            <description>desc CDBGPWRUPREQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CDBGPWRUPACK</name>
                            <description>desc CDBGPWRUPACK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUSTPCTL</name>
                    <description>desc MCUSTPCTL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3B</resetValue>
                    <resetMask>0x7FFFC7</resetMask>
                    <fields>
                        <field>
                            <name>SWDTSTP</name>
                            <description>desc SWDTSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTSTP</name>
                            <description>desc WDTSTP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCSTP</name>
                            <description>desc RTCSTP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M06STP</name>
                            <description>desc M06STP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M07STP</name>
                            <description>desc M07STP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M08STP</name>
                            <description>desc M08STP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M09STP</name>
                            <description>desc M09STP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M10STP</name>
                            <description>desc M10STP</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M11STP</name>
                            <description>desc M11STP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M12STP</name>
                            <description>desc M12STP</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M13STP</name>
                            <description>desc M13STP</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M14STP</name>
                            <description>desc M14STP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M15STP</name>
                            <description>desc M15STP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M16STP</name>
                            <description>desc M16STP</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M17STP</name>
                            <description>desc M17STP</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M18STP</name>
                            <description>desc M18STP</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M19STP</name>
                            <description>desc M19STP</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M20STP</name>
                            <description>desc M20STP</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M21STP</name>
                            <description>desc M21STP</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M22STP</name>
                            <description>desc M22STP</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUTRACECTL</name>
                    <description>desc MCUTRACECTL</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>TRACEMODE</name>
                            <description>desc TRACEMODE</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRACEIOEN</name>
                            <description>desc TRACEIOEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUSTPCTL2</name>
                    <description>desc MCUSTPCTL2</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>M32STP</name>
                            <description>desc M32STP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M33STP</name>
                            <description>desc M33STP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M34STP</name>
                            <description>desc M34STP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M35STP</name>
                            <description>desc M35STP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M36STP</name>
                            <description>desc M36STP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M37STP</name>
                            <description>desc M37STP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M38STP</name>
                            <description>desc M38STP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M39STP</name>
                            <description>desc M39STP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M40STP</name>
                            <description>desc M40STP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M41STP</name>
                            <description>desc M41STP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M42STP</name>
                            <description>desc M42STP</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M43STP</name>
                            <description>desc M43STP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
