hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F4A2.svd
                <register>
                    <name>SEL16</name>
                    <description>desc SEL16</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL17</name>
                    <description>desc SEL17</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL18</name>
                    <description>desc SEL18</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL19</name>
                    <description>desc SEL19</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL20</name>
                    <description>desc SEL20</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL21</name>
                    <description>desc SEL21</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL22</name>
                    <description>desc SEL22</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL23</name>
                    <description>desc SEL23</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL24</name>
                    <description>desc SEL24</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL25</name>
                    <description>desc SEL25</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL26</name>
                    <description>desc SEL26</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL27</name>
                    <description>desc SEL27</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL28</name>
                    <description>desc SEL28</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL29</name>
                    <description>desc SEL29</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL30</name>
                    <description>desc SEL30</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL31</name>
                    <description>desc SEL31</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL32</name>
                    <description>desc SEL32</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL33</name>
                    <description>desc SEL33</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL34</name>
                    <description>desc SEL34</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL35</name>
                    <description>desc SEL35</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL36</name>
                    <description>desc SEL36</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL37</name>
                    <description>desc SEL37</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL38</name>
                    <description>desc SEL38</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL39</name>
                    <description>desc SEL39</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL40</name>
                    <description>desc SEL40</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL41</name>
                    <description>desc SEL41</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL42</name>
                    <description>desc SEL42</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL43</name>
                    <description>desc SEL43</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL44</name>
                    <description>desc SEL44</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL45</name>
                    <description>desc SEL45</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL46</name>
                    <description>desc SEL46</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>INTSEL</name>
                            <description>desc INTSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
