hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F4A2.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PERIC</name>
            <description>desc PERIC</description>
            <baseAddress>0x40055400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USB_SYCTLREG</name>
                    <description>desc USB_SYCTLREG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7070703</resetMask>
                    <fields>
                        <field>
                            <name>USBFS_DFB</name>
                            <description>desc USBFS_DFB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_SOFEN</name>
                            <description>desc USBFS_SOFEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_DFB</name>
                            <description>desc USBHS_DFB</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_SOFEN</name>
                            <description>desc USBHS_SOFEN</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_FSPHYE</name>
                            <description>desc USBHS_FSPHYE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFS</name>
                            <description>desc USBFS_NFS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFE</name>
                            <description>desc USBFS_NFE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_NFS</name>
                            <description>desc USBHS_NFS</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_NFE</name>
                            <description>desc USBHS_NFE</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIOC_SYCTLREG</name>
                    <description>desc SDIOC_SYCTLREG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xA</resetMask>
                    <fields>
                        <field>
                            <name>SELMMC1</name>
                            <description>desc SELMMC1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SELMMC2</name>
                            <description>desc SELMMC2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_STCR</name>
                    <description>desc NFC_STCR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>OPENP</name>
                            <description>desc OPENP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_ENAR</name>
                    <description>desc NFC_ENAR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>NFCEN</name>
                            <description>desc NFCEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_ENAR</name>
                    <description>desc SMC_ENAR</description>
                    <alternateRegister>NFC_ENAR</alternateRegister>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x2</resetMask>
                    <fields>
                        <field>
                            <name>SMCEN</name>
                            <description>desc SMCEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_ENAR</name>
                    <description>desc DMC_ENAR</description>
                    <alternateRegister>NFC_ENAR</alternateRegister>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>DMCEN</name>
                            <description>desc DMCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_SYCTLREG</name>
                    <description>desc CAN_SYCTLREG</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CAN1FDE</name>
                            <description>desc CAN1FDE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2FDE</name>
                            <description>desc CAN2FDE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USART1_NFC</name>
                    <description>desc USART1_NFC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>USASRT1_NFS</name>
                            <description>desc USASRT1_NFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1_NFE</name>
                            <description>desc USART1_NFE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_STSR</name>
                    <description>desc NFC_STSR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>CHIP_BUSY</name>
                            <description>desc CHIP_BUSY</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PECC</name>
                            <description>desc PECC</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
