hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F4A2.svd
                <register>
                    <name>HCTSIZ13</name>
                    <description>desc HCTSIZ13</description>
                    <addressOffset>0x6B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA13</name>
                    <description>desc HCDMA13</description>
                    <addressOffset>0x6B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HCCHAR14</name>
                    <description>desc HCCHAR14</description>
                    <addressOffset>0x6C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFCEFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>desc EPNUM</description>
                            <msb>14</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>desc EPDIR</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>desc LSDEV</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>28</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>desc ODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHDIS</name>
                            <description>desc CHDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHENA</name>
                            <description>desc CHENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINT14</name>
                    <description>desc HCINT14</description>
                    <addressOffset>0x6C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7BF</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHH</name>
                            <description>desc CHH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>desc TXERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERR</name>
                            <description>desc BBERR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMOR</name>
                            <description>desc FRMOR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERR</name>
                            <description>desc DTERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINTMSK14</name>
                    <description>desc HCINTMSK14</description>
                    <addressOffset>0x6CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7BF</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHHM</name>
                            <description>desc CHHM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRM</name>
                            <description>desc AHBERRM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALLM</name>
                            <description>desc STALLM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKM</name>
                            <description>desc NAKM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKM</name>
                            <description>desc ACKM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRM</name>
                            <description>desc TXERRM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERRM</name>
                            <description>desc BBERRM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMORM</name>
                            <description>desc FRMORM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERRM</name>
                            <description>desc DTERRM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCTSIZ14</name>
                    <description>desc HCTSIZ14</description>
                    <addressOffset>0x6D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA14</name>
                    <description>desc HCDMA14</description>
                    <addressOffset>0x6D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HCCHAR15</name>
                    <description>desc HCCHAR15</description>
                    <addressOffset>0x6E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFCEFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>desc EPNUM</description>
                            <msb>14</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>desc EPDIR</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>desc LSDEV</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>28</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>desc ODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHDIS</name>
                            <description>desc CHDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHENA</name>
                            <description>desc CHENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINT15</name>
                    <description>desc HCINT15</description>
                    <addressOffset>0x6E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7BF</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHH</name>
                            <description>desc CHH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>desc TXERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERR</name>
                            <description>desc BBERR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMOR</name>
                            <description>desc FRMOR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERR</name>
                            <description>desc DTERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
